import os


# ------------------------------------------------------------------------------
# Offset reader
# ------------------------------------------------------------------------------
def get_offset(path):
   # Читает offset из файла.
   # - если файл существует → читаем
   # - если файл сломан → возвращаем 0
   # - если файла нет → возвращаем 0

    try:
        if os.path.exists(path):
            with open(path) as f:
                return int(f.read().strip())
    except Exception:
        # любой мусор → считаем как 0
        return 0

    return 0


# ------------------------------------------------------------------------------
# Offset writer
# ------------------------------------------------------------------------------
def set_offset(path, offset):
    # Сохраняет offset в файл.
    # - пишем во временный файл
    # - заменяем основной

    tmp_file = path + ".tmp"

    with open(tmp_file, "w") as f:
        f.write(str(offset))

    os.replace(tmp_file, path)
